In [46]:
import pandas as pd
import numpy as np
from sklearn.linear_model import LinearRegression

In [47]:
df=pd.read_csv('insurance.csv')
df.head(5)

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [48]:
y=df.charges
X=df.drop('charges',axis=1)

In [49]:
y.head(5)

0    16884.92400
1     1725.55230
2     4449.46200
3    21984.47061
4     3866.85520
Name: charges, dtype: float64

In [50]:
X.head(5)

   age     sex     bmi  children smoker     region
0   19  female  27.900         0    yes  southwest
1   18    male  33.770         1     no  southeast
2   28    male  33.000         3     no  southeast
3   33    male  22.705         0     no  northwest
4   32    male  28.880         0     no  northwest

In [51]:
print(df.age.min())
print(df.age.max())

18
64

In [52]:
age_dummies=pd.get_dummies(df.sex)
age_dummies

      female  male
0          1     0
1          0     1
2          0     1
3          0     1
4          0     1
...      ...   ...
1333       0     1
1334       1     0
1335       1     0
1336       1     0
1337       1     0

[1338 rows x 2 columns]

In [53]:
X=pd.concat([X,age_dummies],axis=1)
X.head(5)

   age     sex     bmi  children smoker     region  female  male
0   19  female  27.900         0    yes  southwest       1     0
1   18    male  33.770         1     no  southeast       0     1
2   28    male  33.000         3     no  southeast       0     1
3   33    male  22.705         0     no  northwest       0     1
4   32    male  28.880         0     no  northwest       0     1

In [54]:
X=X.drop('sex',axis=1)
X.head(5)

   age     bmi  children smoker     region  female  male
0   19  27.900         0    yes  southwest       1     0
1   18  33.770         1     no  southeast       0     1
2   28  33.000         3     no  southeast       0     1
3   33  22.705         0     no  northwest       0     1
4   32  28.880         0     no  northwest       0     1

In [55]:
X=X.drop('male',axis=1)
X.head(5)

   age     bmi  children smoker     region  female
0   19  27.900         0    yes  southwest       1
1   18  33.770         1     no  southeast       0
2   28  33.000         3     no  southeast       0
3   33  22.705         0     no  northwest       0
4   32  28.880         0     no  northwest       0

In [56]:
smoker_dummies=pd.get_dummies(df.smoker)
smoker_dummies.head(5)

   no  yes
0   0    1
1   1    0
2   1    0
3   1    0
4   1    0

In [57]:
smoker_dummies=smoker_dummies.drop('yes',axis=1)
smoker_dummies.head(5)

   no
0   0
1   1
2   1
3   1
4   1

In [58]:
X=pd.concat([X,smoker_dummies],axis=1)
X.head(5)

   age     bmi  children smoker     region  female  no
0   19  27.900         0    yes  southwest       1   0
1   18  33.770         1     no  southeast       0   1
2   28  33.000         3     no  southeast       0   1
3   33  22.705         0     no  northwest       0   1
4   32  28.880         0     no  northwest       0   1

In [59]:
X=X.drop('smoker',axis=1)
X.head(5)

   age     bmi  children     region  female  no
0   19  27.900         0  southwest       1   0
1   18  33.770         1  southeast       0   1
2   28  33.000         3  southeast       0   1
3   33  22.705         0  northwest       0   1
4   32  28.880         0  northwest       0   1

In [60]:
region_dummies=pd.get_dummies(df.region)
region_dummies.head(5)

   northeast  northwest  southeast  southwest
0          0          0          0          1
1          0          0          1          0
2          0          0          1          0
3          0          1          0          0
4          0          1          0          0

In [61]:
region_dummies=region_dummies.drop('southwest',axis=1)
region_dummies.head(5)

   northeast  northwest  southeast
0          0          0          0
1          0          0          1
2          0          0          1
3          0          1          0
4          0          1          0

In [62]:
X=pd.concat([X,region_dummies],axis=1)

In [63]:
X=X.drop('region',axis=1)
X.head(5)

   age     bmi  children  female  no  northeast  northwest  southeast
0   19  27.900         0       1   0          0          0          0
1   18  33.770         1       0   1          0          0          1
2   28  33.000         3       0   1          0          0          1
3   33  22.705         0       0   1          0          1          0
4   32  28.880         0       0   1          0          1          0

In [42]:
print(df.bmi.min())
print(df.bmi.max())

15.96
53.13

In [64]:
mean=X.bmi.mean()
mean

30.655022471910097

In [65]:
X.bmi=X.bmi.fillna(mean)

In [66]:
X.head(5)

   age     bmi  children  female  no  northeast  northwest  southeast
0   19  27.900         0       1   0          0          0          0
1   18  33.770         1       0   1          0          0          1
2   28  33.000         3       0   1          0          0          1
3   33  22.705         0       0   1          0          1          0
4   32  28.880         0       0   1          0          1          0

In [70]:
from sklearn.preprocessing import StandardScaler
sc_X = StandardScaler()
X=sc_X.fit_transform(X)
X

array([[-1.43876426e+00, -4.52187478e-01, -9.08613667e-01, ...,
        -5.65266864e-01, -5.66417885e-01, -6.11323672e-01],
       [-1.50996545e+00,  5.11267638e-01, -7.87671916e-02, ...,
        -5.65266864e-01, -5.66417885e-01,  1.63579466e+00],
       [-7.97953548e-01,  3.84885962e-01,  1.58092576e+00, ...,
        -5.65266864e-01, -5.66417885e-01,  1.63579466e+00],
       ...,
       [-1.50996545e+00, -2.91557084e-15, -9.08613667e-01, ...,
        -5.65266864e-01, -5.66417885e-01,  1.63579466e+00],
       [-1.29636188e+00, -7.96864776e-01, -9.08613667e-01, ...,
        -5.65266864e-01, -5.66417885e-01, -6.11323672e-01],
       [ 1.55168573e+00, -2.60152983e-01, -9.08613667e-01, ...,
        -5.65266864e-01,  1.76548098e+00, -6.11323672e-01]])

In [71]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test =train_test_split(X,y,test_size=0.2,random_state=0)

In [72]:
x_train

array([[-0.15714284,  0.56543121,  2.41077224, ..., -0.56526686,
        -0.56641788, -0.61132367],
       [-1.50996545,  0.61959479, -0.90861367, ..., -0.56526686,
        -0.56641788,  1.63579466],
       [-1.1539595 ,  0.98725057,  0.75107928, ...,  1.76907593,
        -0.56641788, -0.61132367],
       ...,
       [ 0.05646073, -0.91503985, -0.90861367, ..., -0.56526686,
        -0.56641788,  1.63579466],
       [-1.43876426,  0.80014004, -0.90861367, ..., -0.56526686,
         1.76548098, -0.61132367],
       [-0.4419476 , -1.99502872, -0.07876719, ..., -0.56526686,
        -0.56641788, -0.61132367]])

In [73]:
y_train

621     40182.24600
194      1137.46970
240     38511.62830
1168     4670.64000
1192    13019.16105
           ...
763      3070.80870
835      7160.33030
1216     5415.66120
559      1646.42970
684      4766.02200
Name: charges, Length: 1070, dtype: float64

In [74]:
model=LinearRegression()
model.fit(x_train,y_train)

LinearRegression()

In [75]:
model.score(x_test,y_test)

0.8001514131507168